#+TITLE: LabBook
#+AUTHOR: CharmVZ Authors
#+STARTUP: overview indent
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport

*** Create Containers

#+begin_src shell :results output :exports both
PE_ELEMENTS=$(cat ${TEMPFILE} | cut -d, -f4 | sort | uniq)
echo ${PE_ELEMENTS}
for pe in ${PE_ELEMENTS}; do
    echo "10 0.0 PE pe${pe} 0"
done
#+end_src

#+RESULTS:
: 0

*** Pjdump this thing to a CSV file

#+begin_src shell :results output :exports both
#OUTPUT="output.pj"
#CSV="output.csv"
#~/dev/pajeng/b13/pj_dump ${OUTPUT} | grep ^State > ${CSV}
#head ${CSV}
#+end_src

#+RESULTS:
#+begin_example
State, pe0, STATE, 26236.000000, 26264.000000, 28.000000, 0.000000, 157
State, pe0, STATE, 26268.000000, 26300.000000, 32.000000, 0.000000, 157
State, pe0, STATE, 26303.000000, 26338.000000, 35.000000, 0.000000, 157
State, pe0, STATE, 26340.000000, 26361.000000, 21.000000, 0.000000, 157
State, pe0, STATE, 26425.000000, 26430.000000, 5.000000, 0.000000, 0
State, pe0, STATE, 26479.000000, 26501.000000, 22.000000, 0.000000, 158
State, pe0, STATE, 26501.000000, 26503.000000, 2.000000, 0.000000, 179
State, pe0, STATE, 26503.000000, 26512.000000, 9.000000, 0.000000, 158
State, pe0, STATE, 26512.000000, 26513.000000, 1.000000, 0.000000, 179
State, pe0, STATE, 26513.000000, 26521.000000, 8.000000, 0.000000, 158
#+end_example

*** How much time on each of these states

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
df |> select(End) |> slice(n()) |> pull(End) -> s.makespan

df |>
  group_by(Value) |>
  summarize(Duration.sum = sum(Duration)) |>
  mutate(P = Duration.sum / s.makespan * 100) |>
  arrange(-Duration.sum)
#+end_src

#+RESULTS:
#+begin_example
# A tibble: 32 × 3
   Value Duration.sum        P
   <dbl>        <dbl>    <dbl>
 1   185     25129563 62.6    
 2   184       695129  1.73   
 3   170       111078  0.277  
 4   181        80995  0.202  
 5     3        57241  0.143  
 6   172        15344  0.0382 
 7   174         6003  0.0149 
 8   171         5761  0.0143 
 9   159         3967  0.00988
10   165         2108  0.00525
# ℹ 22 more rows
# ℹ Use `print(n = ...)` to see more rows
#+end_example

*** How much idle time in a part of the traces that is really computing

#+begin_src R :results output :session *R* :exports both :noweb yes :colnames yes
df |>
  mutate(Next.Start = lead(Start)) |>
  mutate(Gap = Next.Start - End) |>
  filter(Gap != 0) |>
  arrange(-Gap) |>
  select(Gap, everything()) |>
  slice(3:n()) |>
  pull(Gap) |>
  sum() / s.makespan * 100
#+end_src

#+RESULTS:
: [1] 19.45842

